In [2]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]
GradeList = zip(names,grades,bsdegrees,msdegrees,phddegrees)
df = pd.DataFrame(data=GradeList, columns=['Names','Grades','BS Degrees','MS Degrees','Phd Degrees'])
df

     Names  Grades  BS Degrees  MS Degrees  Phd Degrees
0      Bob      76           1           2            0
1  Jessica      95           1           1            1
2     Mary      77           0           0            0
3     John      78           0           0            0
4      Mel      99           1           0            0

In [11]:
df.count()

Names          5
Grades         5
BS Degrees     5
MS Degrees     5
Phd Degrees    5
dtype: int64

In [12]:
df.mean()

Grades         85.0
BS Degrees      0.6
MS Degrees      0.6
Phd Degrees     0.2
dtype: float64

In [13]:
df.std()

Grades         11.067972
BS Degrees      0.547723
MS Degrees      0.894427
Phd Degrees     0.447214
dtype: float64

In [14]:
df.min()

Names          Bob
Grades          76
BS Degrees       0
MS Degrees       0
Phd Degrees      0
dtype: object

In [15]:
df.max()

Names          Mel
Grades          99
BS Degrees       1
MS Degrees       2
Phd Degrees      1
dtype: object

In [16]:
df.quantile(.25)

Grades         77.0
BS Degrees      0.0
MS Degrees      0.0
Phd Degrees     0.0
Name: 0.25, dtype: float64

In [17]:
df.quantile(.5)

Grades         78.0
BS Degrees      1.0
MS Degrees      0.0
Phd Degrees     0.0
Name: 0.5, dtype: float64

In [18]:
df.quantile(.75)

Grades         95.0
BS Degrees      1.0
MS Degrees      1.0
Phd Degrees     0.0
Name: 0.75, dtype: float64

In [19]:
df.median()

Grades         78.0
BS Degrees      1.0
MS Degrees      0.0
Phd Degrees     0.0
dtype: float64

In [25]:
df.mode()

     Names  Grades  BS Degrees  MS Degrees  Phd Degrees
0      Bob      76         1.0         0.0          0.0
1  Jessica      77         NaN         NaN          NaN
2     John      78         NaN         NaN          NaN
3     Mary      95         NaN         NaN          NaN
4      Mel      99         NaN         NaN          NaN

df.var()

In [26]:
df.var()

Grades         122.5
BS Degrees       0.3
MS Degrees       0.8
Phd Degrees      0.2
dtype: float64